Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
infra-flash-commit:29816b2 

Backend config unchanged. Keeping cache.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # data.http.casdoor_oidc_discovery[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "casdoor_oidc_discovery" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + request_headers      = {
          + "Accept" = "application/json"
        }
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = "https://sso.zitian.party/.well-known/openid-configuration"
    }

  # random_id.kubero_session_secret will be created
+ resource "random_id" "kubero_session_secret" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 32
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_id.kubero_webhook_secret will be created
+ resource "random_id" "kubero_webhook_secret" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 32
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # restapi_object.app_dashboard_oidc[0] will be created
+ resource "restapi_object" "app_dashboard_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "add-application"
      + read_path       = "get-application?id=admin"
      + update_path     = "update-application"
    }

  # restapi_object.app_kubero_oidc[0] will be created
+ resource "restapi_object" "app_kubero_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "add-application"
      + read_path       = "get-application?id=admin"
      + update_path     = "update-application"
    }

  # restapi_object.app_portal_gate[0] will be created
+ resource "restapi_object" "app_portal_gate" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "add-application"
      + read_path       = "get-application?id=admin"
      + update_path     = "update-application"
    }

  # restapi_object.app_vault_oidc[0] will be created
+ resource "restapi_object" "app_vault_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "add-application"
      + read_path       = "get-application?id=admin"
      + update_path     = "update-application"
    }

  # restapi_object.provider_github[0] will be created
+ resource "restapi_object" "provider_github" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "add-provider"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "delete-provider"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "add-provider"
      + read_path       = "get-provider?id=admin"
      + update_path     = "update-provider"
    }

  # vault_auth_backend.kubernetes will be created
+ resource "vault_auth_backend" "kubernetes" {
      + accessor        = (known after apply)
      + disable_remount = false
      + id              = (known after apply)
      + path            = "kubernetes"
      + tune            = (known after apply)
      + type            = "kubernetes"
    }

  # vault_jwt_auth_backend.oidc[0] will be created
+ resource "vault_jwt_auth_backend" "oidc" {
      + accessor           = (known after apply)
      + default_role       = "reader"
      + description        = "OIDC backend for Casdoor"
      + disable_remount    = false
      + id                 = (known after apply)
      + local              = false
      + namespace_in_state = true
      + oidc_client_id     = "vault-oidc"
      + oidc_client_secret = (sensitive value)
      + oidc_discovery_url = "https://sso.zitian.party"
      + path               = "oidc"
      + tune               = [
          + {
              + allowed_response_headers     = []
              + audit_non_hmac_request_keys  = []
              + audit_non_hmac_response_keys = []
              + default_lease_ttl            = "1h"
              + listing_visibility           = ""
              + max_lease_ttl                = "8h"
              + passthrough_request_headers  = []
              + token_type                   = "default-service"
            },
        ]
      + type               = "oidc"
    }

  # vault_jwt_auth_backend_role.reader[0] will be created
+ resource "vault_jwt_auth_backend_role" "reader" {
      + allowed_redirect_uris        = [
          + "http://localhost:8250/oidc/callback",
          + "https://secrets.zitian.party/ui/vault/auth/oidc/oidc/callback",
        ]
      + backend                      = "oidc"
      + bound_audiences              = [
          + "vault-oidc",
        ]
      + bound_claims_type            = (known after apply)
      + clock_skew_leeway            = 0
      + disable_bound_claims_parsing = false
      + expiration_leeway            = 0
      + id                           = (known after apply)
      + not_before_leeway            = 0
      + oidc_scopes                  = [
          + "email",
          + "openid",
          + "profile",
        ]
      + role_name                    = "reader"
      + role_type                    = "oidc"
      + token_policies               = [
          + "reader",
        ]
      + token_ttl                    = 3600
      + token_type                   = "default"
      + user_claim                   = "sub"
      + user_claim_json_pointer      = false
      + verbose_oidc_logging         = true
    }

  # vault_kubernetes_auth_backend_config.config will be created
+ resource "vault_kubernetes_auth_backend_config" "config" {
      + backend                           = "kubernetes"
      + disable_iss_validation            = true
      + disable_local_ca_jwt              = (known after apply)
      + id                                = (known after apply)
      + kubernetes_ca_cert                = (known after apply)
      + kubernetes_host                   = "https://kubernetes.default.svc"
      + use_annotations_as_alias_metadata = (known after apply)
    }

  # vault_kubernetes_auth_backend_role.kubero will be created
+ resource "vault_kubernetes_auth_backend_role" "kubero" {
      + alias_name_source                = (known after apply)
      + backend                          = "kubernetes"
      + bound_service_account_names      = [
          + "kubero",
        ]
      + bound_service_account_namespaces = [
          + "kubero-*",
        ]
      + id                               = (known after apply)
      + role_name                        = "kubero"
      + token_policies                   = [
          + "kubero",
        ]
      + token_ttl                        = 3600
      + token_type                       = "default"
    }

  # vault_kv_secret_v2.kubero will be created
+ resource "vault_kv_secret_v2" "kubero" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = true
      + disable_read        = false
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + mount               = "secret"
      + name                = "data/kubero"
      + path                = (known after apply)
    }

  # vault_policy.kubero will be created
+ resource "vault_policy" "kubero" {
      + id     = (known after apply)
      + name   = "kubero"
      + policy = <<-EOT
            path "secret/data/data/kubero" {
              capabilities = ["read"]
            }
        EOT
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
~ sso_e2e_status                 = {
      ~ oidc_discovery = "disabled" -> (known after apply)
      ~ portal_auth    = "disabled" -> "200"
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 14 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`